
#1. Напишите регулярное выражение, которое будет находить в тексте фрагменты, состоящие из одной буквы R, за которой
#следует одна или более букв b, за которой одна r. Учитывать верхний и нижний регистр.












#2. Напишите функцию, выполняющую валидацию номера банковской карты (9999-9999-9999-9999).
#3. Напишите функцию, принимающую строковые данные и выполняющую проверку на их соответствие мейлу.
#Требования:
#-цифры (0-9).
#-только латинские буквы в большом (A-Z) и малом (a-z) регистрах.
#-в теле мейла допустимы только символы “_” и “-”. Но они не могут быть первым символом мейла.
#-символ “-” не может повторяться.
#4. Напишите функцию, проверяющую правильность логина. Правильный логин – строка от 2 до 10 символов, содержащая только буквы и цифры.